f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
menu.cpu=CPU Architecture
menu.speed=CPU Speed
menu.ramsize=RAM Size
menu.protocol=Protocol
menu.pinmap=PIN Map
menu.bitstream=Upload Bitstream to
menu.soc=SOC
menu.fpga=FPGA
menu.jtag=OpenOCD JTAG
menu.model=Model

#
# FPGArduino ULX2S f32c SoC SRAM
#
fpga_ulx2s_sram.name=FER ULX2S (Lattice XP2, 1M SRAM, 81.25 MHz)
fpga_ulx2s_sram.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_ulx2s_sram.build.variant=generic
fpga_ulx2s_sram.build.mcu=f32c
fpga_ulx2s_sram.build.core=f32c
fpga_ulx2s_sram.build.board=F32C_FPGA_ULX2S_SRAM
fpga_ulx2s_sram.build.soc_video_bpp=8
fpga_ulx2s_sram.build.sdata.size=4096
fpga_ulx2s_sram.upload.tool=ujprog
fpga_ulx2s_sram.upload.wait_for_upload_port=false
fpga_ulx2s_sram.upload.native_usb=false
fpga_ulx2s_sram.upload.maximum_size=1015808
fpga_ulx2s_sram.upload.bitstream.command="{cmd.path}" -j {ujprog_target} "{runtime.tools.bootloaders.path}/{bootloader.file}"
fpga_ulx2s_sram.bootloader.file=ulx2s/ulx2s_{chip}_mips_sram{socopt}{f_cpu_MHz}mhz.jed
fpga_ulx2s_sram.menu.cpu.mips=MIPS
fpga_ulx2s_sram.menu.cpu.mips.cpu.arch=mips
fpga_ulx2s_sram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_ulx2s_sram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_ulx2s_sram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_ulx2s_sram.menu.fpga.8e=8E
fpga_ulx2s_sram.menu.fpga.8e.chip=8e
fpga_ulx2s_sram.menu.fpga.5e=5E
fpga_ulx2s_sram.menu.fpga.5e.chip=5e
fpga_ulx2s_sram.menu.soc.normal=Normal (TV, 29 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.normal.socopt=_tv_
fpga_ulx2s_sram.menu.soc.normal.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.normal.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.minimal=Minimal (29 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.minimal.socopt=_minimal_
fpga_ulx2s_sram.menu.soc.minimal.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.minimal.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.fm=Radio (87-108MHz FM/RDS, 28 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.fm.socopt=_fm_
fpga_ulx2s_sram.menu.soc.fm.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.fm.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.433M92=Remote std (433.92MHz, 28 GPIO, 25 MHz)
fpga_ulx2s_sram.menu.soc.433M92.socopt=_433M92_
fpga_ulx2s_sram.menu.soc.433M92.build.f_cpu=25000000
fpga_ulx2s_sram.menu.soc.433M92.f_cpu_MHz=25
fpga_ulx2s_sram.menu.soc.433M33=Remote spec (433.33MHz, 28 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.433M33.socopt=_433M33_
fpga_ulx2s_sram.menu.soc.433M33.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.433M33.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.pid=DC Motors (PID, 16 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.pid.socopt=_pid_
fpga_ulx2s_sram.menu.soc.pid.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.pid.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.vgabit=Video 640x480 (VGA, 16 GPIO, 50 MHz)
fpga_ulx2s_sram.menu.soc.vgabit.socopt=_vgabit_
fpga_ulx2s_sram.menu.soc.vgabit.build.f_cpu=50000000
fpga_ulx2s_sram.menu.soc.vgabit.f_cpu_MHz=50
#fpga_ulx2s_sram.menu.soc.vgatxt80x30=Video text 80x30+640x480 (VGA, 16 GPIO, 50 MHz)
#fpga_ulx2s_sram.menu.soc.vgatxt80x30.socopt=_vgatxt80x30_
#fpga_ulx2s_sram.menu.soc.vgatxt80x30.build.f_cpu=50000000
#fpga_ulx2s_sram.menu.soc.vgatxt80x30.f_cpu_MHz=50
#fpga_ulx2s_sram.menu.soc.vgatxt80x60=Video text 80x60+640x480 (VGA, 16 GPIO, 50 MHz)
#fpga_ulx2s_sram.menu.soc.vgatxt80x60.socopt=_vgatxt80x60_
#fpga_ulx2s_sram.menu.soc.vgatxt80x60.build.f_cpu=50000000
#fpga_ulx2s_sram.menu.soc.vgatxt80x60.f_cpu_MHz=50
fpga_ulx2s_sram.menu.soc.hdmibit=Video 640x480 (HDMI, 16 GPIO, 50 MHz)
fpga_ulx2s_sram.menu.soc.hdmibit.socopt=_hdmibit_
fpga_ulx2s_sram.menu.soc.hdmibit.build.f_cpu=50000000
fpga_ulx2s_sram.menu.soc.hdmibit.f_cpu_MHz=50
#fpga_ulx2s_sram.menu.soc.hdmitxt80x30=Video text 80x30+640x480 (HDMI, 16 GPIO, 50 MHz)
#fpga_ulx2s_sram.menu.soc.hdmitxt80x30.socopt=_hdmitxt80x30_
#fpga_ulx2s_sram.menu.soc.hdmitxt80x30.build.f_cpu=50000000
#fpga_ulx2s_sram.menu.soc.hdmitxt80x30.f_cpu_MHz=50
#fpga_ulx2s_sram.menu.soc.hdmitxt80x60=Video text 80x60+640x480 (HDMI, 16 GPIO, 50 MHz)
#fpga_ulx2s_sram.menu.soc.hdmitxt80x60.socopt=_hdmitxt80x60_
#fpga_ulx2s_sram.menu.soc.hdmitxt80x60.build.f_cpu=50000000
#fpga_ulx2s_sram.menu.soc.hdmitxt80x60.f_cpu_MHz=50
fpga_ulx2s_sram.menu.soc.ledstrip=Video 50x72 (LEDSTRIP, 16 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.ledstrip.socopt=_ledstrip_
fpga_ulx2s_sram.menu.soc.ledstrip.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.ledstrip.f_cpu_MHz=81
fpga_ulx2s_sram.menu.protocol.binftdi=Binary 3 Mbit/s CRC FTDI
fpga_ulx2s_sram.menu.protocol.binftdi.upload.protocol=bin
fpga_ulx2s_sram.menu.protocol.binftdi.upload.flags=-re
fpga_ulx2s_sram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_ulx2s_sram.menu.protocol.bin.upload.protocol=bin
fpga_ulx2s_sram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_ulx2s_sram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_ulx2s_sram.menu.protocol.hex.upload.protocol=hex
fpga_ulx2s_sram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_ulx2s_sram.menu.bitstream.ujprog_sram=SRAM ujprog (temporary)
fpga_ulx2s_sram.menu.bitstream.ujprog_sram.ujprog_target=sram
fpga_ulx2s_sram.menu.bitstream.ujprog_flash=FLASH ujprog (permanent)
fpga_ulx2s_sram.menu.bitstream.ujprog_flash.ujprog_target=flash

#
# FPGArduino ULX2S f32c SoC BRAM
#
fpga_ulx2s_bram.name=FER ULX2S (Lattice XP2, 16K BRAM, 81.25 MHz)
fpga_ulx2s_bram.build.f_cpu=81250000
fpga_ulx2s_bram.build.variant=generic
fpga_ulx2s_bram.build.mcu=f32c
fpga_ulx2s_bram.build.core=f32c
fpga_ulx2s_bram.build.board=F32C_FPGA_ULX2S_BRAM
fpga_ulx2s_bram.build.soc_video_bpp=8
fpga_ulx2s_bram.upload.tool=ujprog
fpga_ulx2s_bram.upload.wait_for_upload_port=false
fpga_ulx2s_bram.upload.native_usb=false
fpga_ulx2s_bram.upload.maximum_size=14848
fpga_ulx2s_bram.upload.bitstream.command="{cmd.path}" -j SRAM "{runtime.tools.bootloaders.path}/{bootloader.file}"
fpga_ulx2s_bram.bootloader.file=ulx2s/ulx2s_8e_{cpu.arch}_bram{socopt}{f_cpu_MHz}mhz.jed
fpga_ulx2s_bram.menu.cpu.mips=MIPS
fpga_ulx2s_bram.menu.cpu.mips.cpu.arch=mips
fpga_ulx2s_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_ulx2s_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_ulx2s_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_ulx2s_bram.menu.cpu.riscv=RISC-V
fpga_ulx2s_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_ulx2s_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_ulx2s_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_ulx2s_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_ulx2s_bram.menu.soc.normal=Normal (29 GPIO, 81.25MHz)
fpga_ulx2s_bram.menu.soc.normal.socopt=_
fpga_ulx2s_bram.menu.soc.normal.build.f_cpu=81250000
fpga_ulx2s_bram.menu.soc.normal.f_cpu_MHz=81
fpga_ulx2s_bram.menu.soc.pid=Special (PID, 16 GPIO, 81.25MHz)
fpga_ulx2s_bram.menu.soc.pid.socopt=_pid_
fpga_ulx2s_bram.menu.soc.pid.build.f_cpu=81250000
fpga_ulx2s_bram.menu.soc.pid.f_cpu_MHz=81
fpga_ulx2s_bram.menu.soc.tx433=433.92MHz (433.92MHz, 16 GPIO, 25MHz)
fpga_ulx2s_bram.menu.soc.tx433.socopt=_433_
fpga_ulx2s_bram.menu.soc.tx433.build.f_cpu=25000000
fpga_ulx2s_bram.menu.soc.tx433.f_cpu_MHz=25
fpga_ulx2s_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_ulx2s_bram.menu.protocol.hex.upload.protocol=hex
fpga_ulx2s_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_ulx2s_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_ulx2s_bram.menu.protocol.bin.upload.protocol=bin
fpga_ulx2s_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re

#
# Terasic DE0-Nano
#
fpga_de0_nano_bram.name=Terasic DE0-Nano (Altera Cyclone-IV, 32K BRAM, 100 MHz)
fpga_de0_nano_bram.build.f_cpu=100000000
fpga_de0_nano_bram.build.variant=generic
fpga_de0_nano_bram.build.mcu=f32c
fpga_de0_nano_bram.build.core=f32c
fpga_de0_nano_bram.build.board=F32C_FPGA_DE0_NANO_BRAM
fpga_de0_nano_bram.build.soc_video_bpp=8
fpga_de0_nano_bram.upload.tool=ujprog
fpga_de0_nano_bram.upload.wait_for_upload_port=false
fpga_de0_nano_bram.upload.native_usb=false
fpga_de0_nano_bram.upload.maximum_size=31232
fpga_de0_nano_bram.upload.protocol=hex
fpga_de0_nano_bram.upload.flags=-P{serial.port} -ra
fpga_de0_nano_bram.menu.cpu.mips=MIPS
fpga_de0_nano_bram.menu.cpu.mips.cpu.arch=mips
fpga_de0_nano_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_de0_nano_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_de0_nano_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_de0_nano_bram.menu.cpu.riscv=RISC-V
fpga_de0_nano_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_de0_nano_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_de0_nano_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_de0_nano_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_de0_nano_bram.menu.ramsize.32K=32 KB BRAM Internal
fpga_de0_nano_bram.menu.ramsize.32K.upload.maximum_size=31232
fpga_de0_nano_bram.menu.ramsize.32K.build.sdata.size=32768
fpga_de0_nano_bram.menu.ramsize.32K.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_de0_nano_bram.menu.ramsize.32M=32 MB SDRAM Onboard
fpga_de0_nano_bram.menu.ramsize.32M.upload.maximum_size=33521664
fpga_de0_nano_bram.menu.ramsize.32M.build.sdata.size=4096
fpga_de0_nano_bram.menu.ramsize.32M.compiler.ld.extra_flags=--section-start=.init=0x80000000

#
# Spartan-3 (3E, 3A, 3AN) Starter Kits
#
fpga_s3starter_bram.name=Xilinx Spartan Starter Kits (S3E/S3A, 32K BRAM, 70 MHz)
fpga_s3starter_bram.build.f_cpu=70000000
fpga_s3starter_bram.build.variant=generic
fpga_s3starter_bram.build.mcu=f32c
fpga_s3starter_bram.build.core=f32c
fpga_s3starter_bram.build.board=F32C_FPGA_S3STARTER_BRAM
fpga_s3starter_bram.build.soc_video_bpp=8
fpga_s3starter_bram.upload.tool=ujprog
fpga_s3starter_bram.upload.wait_for_upload_port=false
fpga_s3starter_bram.upload.native_usb=false
fpga_s3starter_bram.upload.maximum_size=31232
fpga_s3starter_bram.upload.protocol=hex
fpga_s3starter_bram.upload.flags=-P{serial.port} -ra
fpga_s3starter_bram.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c xpc "{runtime.platform.path}/bootloaders/{bootloader.file}"
fpga_s3starter_bram.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c xpc "{runtime.platform.path}/bootloaders/{bootloader.file}"
fpga_s3starter_bram.bootloader.file=xilinx_s3_starter/{bitstream.model}_{cpu.arch}_70mhz.bit
fpga_s3starter_bram.menu.cpu.mips=MIPS
fpga_s3starter_bram.menu.cpu.mips.cpu.arch=mips
fpga_s3starter_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_s3starter_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_s3starter_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_s3starter_bram.menu.cpu.riscv=RISC-V
fpga_s3starter_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_s3starter_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_s3starter_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_s3starter_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_s3starter_bram.menu.model.s3a_700=S3A-700
fpga_s3starter_bram.menu.model.s3a_700.bitstream.model=s3a_700
fpga_s3starter_bram.menu.model.s3an_700=S3AN-700
fpga_s3starter_bram.menu.model.s3an_700.bitstream.model=s3an_700
fpga_s3starter_bram.menu.model.s3e_500=S3E-500
fpga_s3starter_bram.menu.model.s3e_500.bitstream.model=s3e_500
fpga_s3starter_bram.menu.model.s3e_1600=S3E-1600
fpga_s3starter_bram.menu.model.s3e_1600.bitstream.model=s3e_1600

#
# Nexys-3
#
fpga_nexys3_bram.name=Digilent Nexys-3 (Xilinx Spartan-6, 32K BRAM, 80 MHz)
fpga_nexys3_bram.build.f_cpu=80000000
fpga_nexys3_bram.build.variant=generic
fpga_nexys3_bram.build.mcu=f32c
fpga_nexys3_bram.build.core=f32c
fpga_nexys3_bram.build.board=F32C_FPGA_NEXYS3_BRAM
fpga_nexys3_bram.build.soc_video_bpp=8
fpga_nexys3_bram.upload.tool=ujprog
fpga_nexys3_bram.upload.wait_for_upload_port=false
fpga_nexys3_bram.upload.native_usb=false
fpga_nexys3_bram.upload.maximum_size=31232
fpga_nexys3_bram.upload.protocol=hex
fpga_nexys3_bram.upload.flags=-P{serial.port} -ra
fpga_nexys3_bram.menu.cpu.mips=MIPS
fpga_nexys3_bram.menu.cpu.mips.cpu.arch=mips
fpga_nexys3_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_nexys3_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_nexys3_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_nexys3_bram.menu.cpu.riscv=RISC-V
fpga_nexys3_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_nexys3_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_nexys3_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_nexys3_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Basys-3
#
fpga_basys3_bram.name=Digilent Basys-3 (Xilinx Artix-7, 128K BRAM, 100 MHz)
fpga_basys3_bram.build.f_cpu=100000000
fpga_basys3_bram.build.variant=generic
fpga_basys3_bram.build.mcu=f32c
fpga_basys3_bram.build.core=f32c
fpga_basys3_bram.build.board=F32C_FPGA_BASYS3_BRAM
fpga_basys3_bram.build.soc_video_bpp=8
fpga_basys3_bram.upload.tool=ujprog
fpga_basys3_bram.upload.wait_for_upload_port=false
fpga_basys3_bram.upload.native_usb=false
fpga_basys3_bram.upload.maximum_size=129536
fpga_basys3_bram.upload.protocol=hex
fpga_basys3_bram.upload.flags=-P{serial.port} -ra
fpga_basys3_bram.menu.cpu.mips=MIPS
fpga_basys3_bram.menu.cpu.mips.cpu.arch=mips
fpga_basys3_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_basys3_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_basys3_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_basys3_bram.menu.cpu.riscv=RISC-V
fpga_basys3_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_basys3_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_basys3_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_basys3_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_basys3_bram.bootloader.file.svf={runtime.tools.bootloaders.path}/basys3/basys3_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.svf
fpga_basys3_bram.bootloader.file.bit={runtime.tools.bootloaders.path}/basys3/basys3_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.bit
fpga_basys3_bram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/basys3.cfg
fpga_basys3_bram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_basys3_bram.bitstream.fcpu.mhz=100
fpga_basys3_bram.menu.jtag.basys3=BASYS3 onboard JTAG
fpga_basys3_bram.menu.jtag.basys3.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/digilent_adept.cfg
fpga_basys3_bram.menu.ramsize.128=128 KB BRAM Emulated external
fpga_basys3_bram.menu.ramsize.128.upload.maximum_size=129536
fpga_basys3_bram.menu.ramsize.128.build.sdata.size=4096
fpga_basys3_bram.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_basys3_bram.menu.ramsize.128.memsupport=acram_emu
fpga_basys3_bram.menu.ramsize.16=16 KB BRAM Internal
fpga_basys3_bram.menu.ramsize.16.upload.maximum_size=14848
fpga_basys3_bram.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_basys3_bram.menu.ramsize.16.memsupport=bram
fpga_basys3_bram.menu.soc.minimal=Minimal
fpga_basys3_bram.menu.soc.minimal.socopt=minimal
fpga_basys3_bram.menu.soc.vector=Vector FPU
fpga_basys3_bram.menu.soc.vector.socopt=vector
fpga_basys3_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_basys3_bram.menu.protocol.bin.upload.protocol=bin
fpga_basys3_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_basys3_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_basys3_bram.menu.protocol.hex.upload.protocol=hex
fpga_basys3_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_basys3_bram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_basys3_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c jtaghs1_fast -p 1 "{bootloader.file.bit}"
fpga_basys3_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c jtaghs1_fast -p 1 "{bootloader.file.bit}"
fpga_basys3_bram.menu.bitstream.sram_openocd=SRAM openocd (temporary)
fpga_basys3_bram.menu.bitstream.sram_openocd.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"

