f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
#
# ZYBO
#
fpga_zybo_bram.name=Digilent ZYBO (Xilinx Zynq 7010, 128K BRAM, 100 MHz)
fpga_zybo_bram.build.f_cpu=100000000
fpga_zybo_bram.build.variant=generic
fpga_zybo_bram.build.mcu=f32c
fpga_zybo_bram.build.core=f32c
fpga_zybo_bram.build.board=F32C_FPGA_ZYBO_BRAM
fpga_zybo_bram.build.soc_video_bpp=8
fpga_zybo_bram.build.sdata.size=4096
fpga_zybo_bram.upload.tool=ujprog
fpga_zybo_bram.upload.wait_for_upload_port=false
fpga_zybo_bram.upload.native_usb=false
#fpga_zybo_bram.upload.maximum_size=129536
#fpga_zybo_bram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_zybo_bram.bootloader.file.svf={runtime.tools.bootloaders.path}/zybo/zybo_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.svf
fpga_zybo_bram.bootloader.file.bit={runtime.tools.bootloaders.path}/zybo/zybo_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.bit
fpga_zybo_bram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/zybo.cfg
fpga_zybo_bram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_zybo_bram.bitstream.fcpu.mhz=100
fpga_zybo_bram.menu.cpu.mips=MIPS
fpga_zybo_bram.menu.cpu.mips.cpu.arch=mips
fpga_zybo_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_zybo_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_zybo_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_zybo_bram.menu.cpu.riscv=RISC-V
fpga_zybo_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_zybo_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_zybo_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_zybo_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_zybo_bram.menu.jtag.zybo=ZYBO onboard JTAG
fpga_zybo_bram.menu.jtag.zybo.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/digilent_adept.cfg
fpga_zybo_bram.menu.jtag.fpu1=PLDkit FPU1 JTAG
fpga_zybo_bram.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_zybo_bram.menu.ramsize.128=128 KB BRAM Emulated external
fpga_zybo_bram.menu.ramsize.128.upload.maximum_size=129536
fpga_zybo_bram.menu.ramsize.128.build.sdata.size=4096
fpga_zybo_bram.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_zybo_bram.menu.ramsize.128.memsupport=acram_emu
fpga_zybo_bram.menu.ramsize.16=16 KB BRAM Internal
fpga_zybo_bram.menu.ramsize.16.upload.maximum_size=14848
fpga_zybo_bram.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_zybo_bram.menu.ramsize.16.memsupport=bram
fpga_zybo_bram.menu.soc.vgatxt80x30=text 80x30 bitmap 640x480
fpga_zybo_bram.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_zybo_bram.menu.soc.vgatxt80x60=text 80x60 bitmap 640x480
fpga_zybo_bram.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_zybo_bram.menu.soc.vgabit=Bitmap 640x480
fpga_zybo_bram.menu.soc.vgabit.socopt=vgabit640x480
fpga_zybo_bram.menu.soc.vector=Bitmat 640x480 Vector FPU
fpga_zybo_bram.menu.soc.vector.socopt=vgabit640x480_vector
fpga_zybo_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_zybo_bram.menu.protocol.bin.upload.protocol=bin
fpga_zybo_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_zybo_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_zybo_bram.menu.protocol.hex.upload.protocol=hex
fpga_zybo_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_zybo_bram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_zybo_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c jtaghs1_fast -p 1 "{bootloader.file.bit}"
fpga_zybo_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c jtaghs1_fast -p 1 "{bootloader.file.bit}"
fpga_zybo_bram.menu.bitstream.sram_openocd=SRAM openocd (temporary)
fpga_zybo_bram.menu.bitstream.sram_openocd.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"

#
# Lattice Brevia / Brevia2
#
fpga_brevia_bram.name=Lattice Brevia boards (Lattice XP2, 16K BRAM, 81.25 MHz)
fpga_brevia_bram.build.f_cpu=81250000
fpga_brevia_bram.build.variant=generic
fpga_brevia_bram.build.mcu=f32c
fpga_brevia_bram.build.core=f32c
fpga_brevia_bram.build.board=F32C_FPGA_BREVIA_BRAM
fpga_brevia_bram.build.soc_video_bpp=8
fpga_brevia_bram.upload.tool=ujprog
fpga_brevia_bram.upload.wait_for_upload_port=false
fpga_brevia_bram.upload.native_usb=false
fpga_brevia_bram.upload.maximum_size=14848
fpga_brevia_bram.upload.protocol=hex
fpga_brevia_bram.upload.flags=-P{serial.port} -ra
fpga_brevia_bram.menu.cpu.mips=MIPS
fpga_brevia_bram.menu.cpu.mips.cpu.arch=mips
fpga_brevia_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_brevia_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_brevia_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_brevia_bram.menu.cpu.riscv=RISC-V
fpga_brevia_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_brevia_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_brevia_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_brevia_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# E2LP
#
fpga_e2lp_bram.name=E2LP (Xilinx Spartan-6, 128K BRAM, 80 MHz)
fpga_e2lp_bram.build.f_cpu=80000000
fpga_e2lp_bram.build.variant=generic
fpga_e2lp_bram.build.mcu=f32c
fpga_e2lp_bram.build.core=f32c
fpga_e2lp_bram.build.board=F32C_FPGA_E2LP_BRAM
fpga_e2lp_bram.build.soc_video_bpp=8
fpga_e2lp_bram.upload.tool=ujprog
fpga_e2lp_bram.upload.wait_for_upload_port=false
fpga_e2lp_bram.upload.native_usb=false
fpga_e2lp_bram.upload.maximum_size=129536
fpga_e2lp_bram.upload.protocol=hex
fpga_e2lp_bram.upload.flags=-P{serial.port} -ra
fpga_e2lp_bram.menu.cpu.mips=MIPS
fpga_e2lp_bram.menu.cpu.mips.cpu.arch=mips
fpga_e2lp_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_e2lp_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_e2lp_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_e2lp_bram.menu.cpu.riscv=RISC-V
fpga_e2lp_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_e2lp_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_e2lp_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_e2lp_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Xilinx Scarab Hardware miniSpartan6+ Board, f32c SoC
#
fpga_scarab_sdram.name=Scarab miniSpartan6+ (Xilinx Spartan-6 XC6SLX25, 64K BRAM, 81.25/112.5 MHz)
fpga_scarab_sdram.build.mcu=f32c
fpga_scarab_sdram.build.core=f32c
fpga_scarab_sdram.build.board=F32C_FPGA_SCARAB_BRAM
fpga_scarab_sdram.upload.tool=ujprog
fpga_scarab_sdram.upload.wait_for_upload_port=false
fpga_scarab_sdram.upload.native_usb=false
fpga_scarab_sdram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/scarab_ms6p.cfg
fpga_scarab_sdram.bootloader.file.svf={runtime.tools.bootloaders.path}/scarab/scarab_{memsupport}_{chip}_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.svf
fpga_scarab_sdram.bootloader.file.bit={runtime.tools.bootloaders.path}/scarab/scarab_{memsupport}_{chip}_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.bit
fpga_scarab_sdram.bootloader.jtag_spi_bridge.bit={runtime.tools.bootloaders.path}/scarab/bscan_xc6s_ftg256_blink.bit
fpga_scarab_sdram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_scarab_sdram.menu.cpu.mips=MIPS
fpga_scarab_sdram.menu.cpu.mips.cpu.arch=mips
fpga_scarab_sdram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_scarab_sdram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_scarab_sdram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_scarab_sdram.menu.cpu.riscv=RISC-V
fpga_scarab_sdram.menu.cpu.riscv.cpu.arch=riscv
fpga_scarab_sdram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_scarab_sdram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_scarab_sdram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_scarab_sdram.menu.fpga.lx25=XC6SLX25
fpga_scarab_sdram.menu.fpga.lx25.chip=xc6slx25
fpga_scarab_sdram.menu.fpga.lx9=XC6SLX9
fpga_scarab_sdram.menu.fpga.lx9.chip=xc6slx9
fpga_scarab_sdram.menu.ramsize.32M=32 MB SDRAM Onboard
fpga_scarab_sdram.menu.ramsize.32M.upload.maximum_size=33521664
fpga_scarab_sdram.menu.ramsize.32M.build.sdata.size=4096
fpga_scarab_sdram.menu.ramsize.32M.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_scarab_sdram.menu.ramsize.32M.memsupport=sdram
fpga_scarab_sdram.menu.ramsize.32K=32 KB BRAM Internal
fpga_scarab_sdram.menu.ramsize.32K.upload.maximum_size=31232
fpga_scarab_sdram.menu.ramsize.32K.build.sdata.size=32768
fpga_scarab_sdram.menu.ramsize.32K.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_scarab_sdram.menu.ramsize.32K.memsupport=bram
fpga_scarab_sdram.menu.soc.vgatxt80x30=text 80x30 bitmap 640x480
fpga_scarab_sdram.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_scarab_sdram.menu.soc.vgatxt80x30.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgatxt80x60=text 80x60 bitmap 640x480
fpga_scarab_sdram.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_scarab_sdram.menu.soc.vgatxt80x60.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp=bitmap 640x480 8bpp
fpga_scarab_sdram.menu.soc.vgabit8bpp.socopt=vgabit8bpp
fpga_scarab_sdram.menu.soc.vgabit8bpp.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp_vector=bitmap 640x480 8bpp Vector FPU
fpga_scarab_sdram.menu.soc.vgabit8bpp_vector.socopt=vgabit8bpp_vector
fpga_scarab_sdram.menu.soc.vgabit8bpp_vector.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit16bpp=bitmap 640x480 16bpp
fpga_scarab_sdram.menu.soc.vgabit16bpp.socopt=vgabit16bpp
fpga_scarab_sdram.menu.soc.vgabit16bpp.build.soc_video_bpp=16
fpga_scarab_sdram.menu.soc.vgabit16bpp_vector=bitmap 640x480 16bpp Vector FPU
fpga_scarab_sdram.menu.soc.vgabit16bpp_vector.socopt=vgabit16bpp_vector
fpga_scarab_sdram.menu.soc.vgabit16bpp_vector.build.soc_video_bpp=16
fpga_scarab_sdram.menu.soc.vgabit32bpp=bitmap 640x480 32bpp
fpga_scarab_sdram.menu.soc.vgabit32bpp.socopt=vgabit32bpp
fpga_scarab_sdram.menu.soc.vgabit32bpp.build.soc_video_bpp=32
fpga_scarab_sdram.menu.speed.100=100 MHz
fpga_scarab_sdram.menu.speed.100.build.f_cpu=100000000
fpga_scarab_sdram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.speed.83=83.33 MHz
fpga_scarab_sdram.menu.speed.83.build.f_cpu=83333333
fpga_scarab_sdram.menu.speed.83.bitstream.fcpu.mhz=83
fpga_scarab_sdram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_scarab_sdram.menu.protocol.bin.upload.protocol=bin
fpga_scarab_sdram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_scarab_sdram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_scarab_sdram.menu.protocol.hex.upload.protocol=hex
fpga_scarab_sdram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_scarab_sdram.menu.pinmap.generic=Generic
fpga_scarab_sdram.menu.pinmap.generic.build.variant=generic
fpga_scarab_sdram.menu.jtag.ft2232=Onboard FT2232 JTAG
fpga_scarab_sdram.menu.jtag.ft2232.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/ft2232-generic.ocd
fpga_scarab_sdram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_scarab_sdram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ftdi_fast "{bootloader.file.bit}"
fpga_scarab_sdram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c ftdi_fast "{bootloader.file.bit}"
fpga_scarab_sdram.menu.bitstream.flash_xc3sprog=FLASH xc3sprog (permanent)
fpga_scarab_sdram.menu.bitstream.flash_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ftdi_fast "-I{bootloader.jtag_spi_bridge.bit}" "{bootloader.file.bit}"
fpga_scarab_sdram.menu.bitstream.flash_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c ftdi_fast "-I{bootloader.jtag_spi_bridge.bit}" "{bootloader.file.bit}"
fpga_scarab_sdram.menu.bitstream.sram_openocd=SRAM openocd (temporary)
fpga_scarab_sdram.menu.bitstream.sram_openocd.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"

#
# Xilinx TB299 Board (ebay), f32c SoC
#
fpga_tb299.name=TB299 (Xilinx Spartan-6 XC6SLX9, 32K BRAM, 81.25/112.5 MHz)
fpga_tb299.build.mcu=f32c
fpga_tb299.build.core=f32c
fpga_tb299.build.board=F32C_FPGA_TB299
fpga_tb299.build.soc_video_bpp=8
fpga_tb299.upload.tool=ujprog
fpga_tb299.upload.wait_for_upload_port=false
fpga_tb299.upload.native_usb=false
fpga_tb299.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_tb299.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/tb299.cfg
fpga_tb299.bootloader.openocd.command=svf -tap chip.tap {{runtime.tools.bootloaders.path}/tb299/xc6slx9_{cpu.arch}_{bitstream.fcpu.mhz}mhz.svf}
fpga_tb299.menu.cpu.mips=MIPS
fpga_tb299.menu.cpu.mips.cpu.arch=mips
fpga_tb299.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_tb299.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_tb299.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_tb299.menu.cpu.riscv=RISC-V
fpga_tb299.menu.cpu.riscv.cpu.arch=riscv
fpga_tb299.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_tb299.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_tb299.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_tb299.menu.ramsize.32=32 KB BRAM Internal
fpga_tb299.menu.ramsize.32.upload.maximum_size=31232
fpga_tb299.menu.ramsize.32.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_tb299.menu.speed.81=81.25 MHz
fpga_tb299.menu.speed.81.build.f_cpu=81250000
fpga_tb299.menu.speed.81.bitstream.fcpu.mhz=81
fpga_tb299.menu.speed.112=112.5 MHz
fpga_tb299.menu.speed.112.build.f_cpu=112500000
fpga_tb299.menu.speed.112.bitstream.fcpu.mhz=112
fpga_tb299.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_tb299.menu.protocol.hex.upload.protocol=hex
fpga_tb299.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_tb299.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_tb299.menu.protocol.bin.upload.protocol=bin
fpga_tb299.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_tb299.menu.pinmap.generic=Generic
fpga_tb299.menu.pinmap.generic.build.variant=generic
fpga_tb299.menu.jtag.alterablaster=Altera Blaster
fpga_tb299.menu.jtag.alterablaster.bootloader.openocd.interface={runtime.tools.openocd.path}/scripts/interface/altera-usb-blaster.cfg
fpga_tb299.menu.jtag.remotebitbang=Remote bitbang (TCP jtag:3335)
fpga_tb299.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_tb299.menu.jtag.fpu1=PLDkit FPU1 JTAG
fpga_tb299.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg

