f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
#
# Altera TB276 Board (ebay), f32c SoC
#
fpga_tb276.name=TB276 (Altera Cyclone IV E EP4CE6, 16K BRAM, 81.25/112.5 MHz)
fpga_tb276.build.mcu=f32c
fpga_tb276.build.core=f32c
fpga_tb276.build.board=F32C_FPGA_TB276
fpga_tb276.build.soc_video_bpp=8
fpga_tb276.upload.tool=ujprog
fpga_tb276.upload.wait_for_upload_port=false
fpga_tb276.upload.native_usb=false
fpga_tb276.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/tb276.cfg
fpga_tb276.bootloader.file.svf={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.svf
fpga_tb276.bootloader.file.jic={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.jic
fpga_tb276.bootloader.file.sof={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.sof
fpga_tb276.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_tb276.menu.cpu.mips=MIPS
fpga_tb276.menu.cpu.mips.cpu.arch=mips
fpga_tb276.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_tb276.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_tb276.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_tb276.menu.cpu.riscv=RISC-V
fpga_tb276.menu.cpu.riscv.cpu.arch=riscv
fpga_tb276.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_tb276.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_tb276.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_tb276.menu.ramsize.16=16 KB BRAM Internal
fpga_tb276.menu.ramsize.16.upload.maximum_size=14848
fpga_tb276.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_tb276.menu.speed.81=81.25 MHz
fpga_tb276.menu.speed.81.build.f_cpu=81250000
fpga_tb276.menu.speed.81.bitstream.fcpu.mhz=81
fpga_tb276.menu.speed.112=112.5 MHz
fpga_tb276.menu.speed.112.build.f_cpu=112500000
fpga_tb276.menu.speed.112.bitstream.fcpu.mhz=112
fpga_tb276.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_tb276.menu.protocol.hex.upload.protocol=hex
fpga_tb276.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_tb276.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_tb276.menu.protocol.bin.upload.protocol=bin
fpga_tb276.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_tb276.menu.pinmap.generic=Generic
fpga_tb276.menu.pinmap.generic.build.variant=generic
fpga_tb276.menu.jtag.alterablaster=Altera Blaster
fpga_tb276.menu.jtag.alterablaster.bootloader.openocd.interface={runtime.tools.openocd.path}/scripts/interface/altera-usb-blaster.cfg
fpga_tb276.menu.jtag.remotebitbang=Remote bitbang (TCP jtag:3335)
fpga_tb276.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_tb276.menu.jtag.fpu1=FT2232 PLDkit FPU1
fpga_tb276.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_tb276.menu.bitstream.sram=SRAM openocd (temporary)
fpga_tb276.menu.bitstream.sram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_tb276.menu.bitstream.sramquartus=SRAM quartus (temporary)
fpga_tb276.menu.bitstream.sramquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "P;{bootloader.file.sof}"
fpga_tb276.menu.bitstream.flashquartus=FLASH quartus (permanent)
fpga_tb276.menu.bitstream.flashquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "IPV;{bootloader.file.jic}"

#
# Xilinx Numato Mimas V2 Spartan-6
#
fpga_numato_mimasv2_bram.name=MimasV2 (Xilinx Spartan-6 XC6SLX9, 32K BRAM, 100 MHz)
fpga_numato_mimasv2_bram.build.mcu=f32c
fpga_numato_mimasv2_bram.build.core=f32c
fpga_numato_mimasv2_bram.build.board=F32C_FPGA_MIMASV2_BRAM
fpga_numato_mimasv2_bram.build.soc_video_bpp=8
fpga_numato_mimasv2_bram.upload.tool=ujprog
fpga_numato_mimasv2_bram.upload.wait_for_upload_port=false
fpga_numato_mimasv2_bram.upload.native_usb=false
fpga_numato_mimasv2_bram.upload.bitstream.command=python3 "{runtime.tools.numato.path}/MimasV2Config.py" "{serial.port}" "{bootloader.file.bin}"
fpga_numato_mimasv2_bram.bootloader.file.bin={runtime.tools.bootloaders.path}/numato_mimas_v2/numato_mimasv2_bram_{cpu.arch}_hdmi_{bitstream.fcpu.mhz}mhz.bin
fpga_numato_mimasv2_bram.menu.cpu.mips=MIPS
fpga_numato_mimasv2_bram.menu.cpu.mips.cpu.arch=mips
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv=RISC-V
fpga_numato_mimasv2_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_numato_mimasv2_bram.menu.ramsize.32=32 KB BRAM Internal
fpga_numato_mimasv2_bram.menu.ramsize.32.upload.maximum_size=31232
fpga_numato_mimasv2_bram.menu.ramsize.32.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_numato_mimasv2_bram.menu.speed.100=100 MHz
fpga_numato_mimasv2_bram.menu.speed.100.build.f_cpu=100000000
fpga_numato_mimasv2_bram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_numato_mimasv2_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_numato_mimasv2_bram.menu.protocol.hex.upload.protocol=hex
fpga_numato_mimasv2_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_numato_mimasv2_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_numato_mimasv2_bram.menu.protocol.bin.upload.protocol=bin
fpga_numato_mimasv2_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_numato_mimasv2_bram.menu.pinmap.generic=Generic
fpga_numato_mimasv2_bram.menu.pinmap.generic.build.variant=generic

#
# Xilinx ESA11 Artix-7 board (Emanuel Stiebler)
#
fpga_esa11_xram.name=ESA11 (Xilinx Artix-7 XC7A35I/XC7A102T, 128K BRAM, 100 MHz)
fpga_esa11_xram.build.mcu=f32c
fpga_esa11_xram.build.core=f32c
fpga_esa11_xram.build.board=F32C_FPGA_ESA11_{chip}_BRAM
fpga_esa11_xram.upload.tool=ujprog
fpga_esa11_xram.upload.wait_for_upload_port=false
fpga_esa11_xram.upload.native_usb=false
#fpga_esa11_xram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/esa11_7a35i_ms6p.cfg
fpga_esa11_xram.bootloader.file.bit={runtime.tools.bootloaders.path}/esa11/esa11_{chip}_{memsupport}_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.bit
#fpga_esa11_xram.bootloader.jtag_spi_bridge.bit={runtime.tools.bootloaders.path}/esa11_7a35i/bscan_xc7a_fgg484_blink.bit
fpga_esa11_xram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_esa11_xram.menu.cpu.mips=MIPS
fpga_esa11_xram.menu.cpu.mips.cpu.arch=mips
fpga_esa11_xram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_esa11_xram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_esa11_xram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_esa11_xram.menu.cpu.riscv=RISC-V
fpga_esa11_xram.menu.cpu.riscv.cpu.arch=riscv
fpga_esa11_xram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_esa11_xram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_esa11_xram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_esa11_xram.menu.fpga.7a102t=7a102t
fpga_esa11_xram.menu.fpga.7a102t.chip=7a102t
fpga_esa11_xram.menu.fpga.7a35i=7a35i
fpga_esa11_xram.menu.fpga.7a35i.chip=7a35i
fpga_esa11_xram.menu.ramsize.256M=256 MB DDR3 External
fpga_esa11_xram.menu.ramsize.256M.upload.maximum_size=256000000
fpga_esa11_xram.menu.ramsize.256M.build.sdata.size=4096
fpga_esa11_xram.menu.ramsize.256M.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_esa11_xram.menu.ramsize.256M.memsupport=ddr3
fpga_esa11_xram.menu.ramsize.128=128 KB BRAM Emulated external
fpga_esa11_xram.menu.ramsize.128.upload.maximum_size=129536
fpga_esa11_xram.menu.ramsize.128.build.sdata.size=4096
fpga_esa11_xram.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_esa11_xram.menu.ramsize.128.memsupport=bram
fpga_esa11_xram.menu.ramsize.16=16 KB BRAM Internal
fpga_esa11_xram.menu.ramsize.16.upload.maximum_size=14848
fpga_esa11_xram.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_esa11_xram.menu.ramsize.16.memsupport=bram
fpga_esa11_xram.menu.soc.vgatxt80x30=text 80x30 bitmap 640x480
fpga_esa11_xram.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_esa11_xram.menu.soc.vgatxt80x30.build.soc_video_bpp=8
fpga_esa11_xram.menu.soc.vgatxt80x30.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgatxt80x30.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgatxt80x60=text 80x60 bitmap 640x480
fpga_esa11_xram.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_esa11_xram.menu.soc.vgatxt80x60.build.soc_video_bpp=8
fpga_esa11_xram.menu.soc.vgatxt80x60.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgatxt80x60.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit8bpp=bitmap 640x480 8bpp
fpga_esa11_xram.menu.soc.vgabit8bpp.socopt=vgabit8bpp
fpga_esa11_xram.menu.soc.vgabit8bpp.build.soc_video_bpp=8
fpga_esa11_xram.menu.soc.vgabit8bpp.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit8bpp.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit16bpp=bitmap 640x480 16bpp
fpga_esa11_xram.menu.soc.vgabit16bpp.socopt=vgabit16bpp
fpga_esa11_xram.menu.soc.vgabit16bpp.build.soc_video_bpp=16
fpga_esa11_xram.menu.soc.vgabit16bpp.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit16bpp.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit32bpp=bitmap 640x480 32bpp
fpga_esa11_xram.menu.soc.vgabit32bpp.socopt=vgabit32bpp
fpga_esa11_xram.menu.soc.vgabit32bpp.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit32bpp.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit32bpp.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector=bitmap 640x360 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector.socopt=vgabit640x360_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector=bitmap 640x480 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector.socopt=vgabit640x480_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector=bitmap 800x480 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector.socopt=vgabit800x480_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector=bitmap 800x600 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector.socopt=vgabit800x600_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector=bitmap 1024x576 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector.socopt=vgabit1024x576_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector=bitmap 1024x768 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector.socopt=vgabit1024x768_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector.build.f_cpu=108000000
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector.bitstream.fcpu.mhz=108
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector=bitmap 1280x1024 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector.socopt=vgabit1280x1024_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector.build.f_cpu=108000000
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector.bitstream.fcpu.mhz=108
fpga_esa11_xram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_esa11_xram.menu.protocol.bin.upload.protocol=bin
fpga_esa11_xram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_esa11_xram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_esa11_xram.menu.protocol.hex.upload.protocol=hex
fpga_esa11_xram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_esa11_xram.menu.pinmap.generic=Generic
fpga_esa11_xram.menu.pinmap.generic.build.variant=generic
fpga_esa11_xram.menu.pinmap.esa11=ESA11
fpga_esa11_xram.menu.pinmap.esa11.build.variant=esa11
fpga_esa11_xram.menu.jtag.ft4232=Onboard FT4232 JTAG
#fpga_esa11_xram.menu.jtag.ft4232.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/ft4232-generic.ocd
fpga_esa11_xram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_esa11_xram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ft4232h_fast "{bootloader.file.bit}"
fpga_esa11_xram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c ft4232h_fast "{bootloader.file.bit}"

